// task 1,2
double pi = 3.141592653;
decimal e = 2.7182818284590452m;
Console.WriteLine("pi = {0}, e = {1}", pi, e);
//task 3
string str1 = "\nмоя строка 1";
string str2 = "\tмоя строка 2";
string str3 = "\aмоя строка 3";
Console.Write("{0},{1},{2}", str1, str2, str3);
/* task 4
 * Типы значений (справочник по C#) - статья описывает разницу и принцыпы работы разных типов значений 
 * MSDN: Переменные и константы. - статья описывает способность и способы применения Переменных и констант
 * Юникодь - статья описывает стандартную кодировку символов и ее различные вариации
 * UTF-16 - способ кодирования символовов использующий 16 битные слова
 * Система_счисления - статься про различные системы счисления, их логику, и использование в различных местах, а также причины их использования в них
 * Экспоненциальная_запись - способ записи числа через мантису и порядок числа используемый при записи очень больших либо маленьких чисел
 * Перевод чисел из одной системы в другую - числа можна переводить в разные системы простыми методамы с использованием алгоритмов
 * Числовые типы с плавающей запятой (справочник по C#) - статья описывает разницу и принцыпы работы  Числовых типов с плавающей запятой таких как double float decimal
 */